DataProcessors/ЛБ_ПроверкаЧастичныхСовпадений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЛБ_ПроверкаЧастичныхСовпадений</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЛБ_ЧастичныеСовпаденияПоПеречням.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ЧастичныеСовпаденияПоПеречням</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСовпадения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыЧастичныхСовпадений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетПроверки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разрешено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запрещено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудникОбнаружил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудникПроверил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИВремяСовпадения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокаСовпадения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЛБ_ПроверкаЧастичныхСовпадений/Forms/ФормаДетальныйПросмотр/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Залогодатель = Параметры.Отбор.Залогодатель;
КонецПроцедуры

&НаКлиенте
Процедура ИсторияПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИсторияПриАктивизацииСтроки(Элемент)
	ТекСтр = Элемент.ТекущиеДанные;
	
	Если ТекСтр.ДатаИВремяСовпадения = Дата(1,1,1) Тогда
		ДатаПоиска = ТекСтр.Период;
	Иначе
		ДатаПоиска = ТекСтр.ДатаИВремяСовпадения;
	КонецЕсли;
	
	ЗаполнитьСовпадения(Залогодатель, ДатаПоиска);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСовпадения(Залогодатель, Дата)
	
	Совпадения.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ЧастичныеСовпаденияПоПеречнямСрезПервых.Период КАК Период,
		|	ЛБ_ЧастичныеСовпаденияПоПеречнямСрезПервых.Залогодатель КАК Залогодатель,
		|	ЛБ_ЧастичныеСовпаденияПоПеречнямСрезПервых.СтрокаСовпадения КАК СтрокаСовпадения
		|ИЗ
		|	РегистрСведений.ЛБ_ЧастичныеСовпаденияПоПеречням.СрезПервых(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_ЧастичныеСовпаденияПоПеречнямСрезПервых
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		МассивСтрокСовпадения = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(РезультатЗапроса.СтрокаСовпадения, ";", Ложь);
		
		Для каждого СтрМ Из МассивСтрокСовпадения Цикл
			МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрМ, "|", Ложь);
			
			Если МассивСтрок.Количество() = 5 Тогда
				НаваяСтр = Совпадения.Добавить();
				
				Если МассивСтрок[0] = "Наим" Тогда
					НаваяСтр.Наименование = МассивСтрок[1];
				ИначеЕсли МассивСтрок[0] = "ДрНаим" Тогда
					НаваяСтр.ДрНаименование = МассивСтрок[1];
				КонецЕсли;
				
				НаваяСтр.ИД = МассивСтрок[2];
				НаваяСтр.ДатаРождения = СтроковыеФункцииКлиентСервер.СтрокаВДату(МассивСтрок[3]);
				НаваяСтр.ВидПеречня = МассивСтрок[4];
			Иначе
				Сообщить("Некорректно заполнена строка совпадения");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
